; domain
(define (domain blocksworld)
  (:requirements :strips :typing)
  (:types block)

  (:predicates
    (ontable ?x - block)
    (on ?x - block ?y - block)
    (clear ?x - block)
    (handempty)
    (holding ?x - block)
  )

  (:action pick
    :parameters (?x - block)
    :precondition (and (clear ?x) (ontable ?x) (handempty))
    :effect (and (holding ?x)
                 (not (ontable ?x))
                 (not (clear ?x))
                 (not (handempty)))
  )

  (:action putdown
    :parameters (?x - block)
    :precondition (and (holding ?x))
    :effect (and (ontable ?x)
                 (clear ?x)
                 (handempty)
                 (not (holding ?x)))
  )

  (:action stack
    :parameters (?x - block ?y - block)
    :precondition (and (holding ?x) (clear ?y))
    :effect (and (on ?x ?y)
                 (clear ?x)
                 (handempty)
                 (not (holding ?x))
                 (not (clear ?y)))
  )

  (:action unstack
    :parameters (?x - block ?y - block)
    :precondition (and (on ?x ?y) (clear ?x) (handempty))
    :effect (and (holding ?x)
                 (clear ?y)
                 (not (on ?x ?y))
                 (not (clear ?x))
                 (not (handempty)))
  )
)

; problem
(define (problem two_towers)
  (:domain blocksworld)
  (:objects r g b y m c - block)
  (:init
        (clear b)
        (clear c)
        (clear g)
        (clear m)
        (clear r)
        (clear y)
        (handempty)
        (ontable b)
        (ontable c)
        (ontable g)
        (ontable m)
        (ontable r)
        (ontable y)
  )
  (:goal (and (on r g) (on g b) (on y m) (on m c)))
)

; plan
1. (pick r)
   deleted: (ontable r) (clear r) (handempty)
   added: (holding r)
   goals met: 0 of 4
2. (stack r g)
   deleted: (holding r) (clear g)
   added: (on r g) (clear r) (handempty)
   goals met: 1 of 4
3. (pick m)
   deleted: (ontable m) (clear m) (handempty)
   added: (holding m)
   goals met: 1 of 4
4. (stack m c)
   deleted: (holding m) (clear c)
   added: (on m c) (clear m) (handempty)
   goals met: 2 of 4
5. (pick y)
   deleted: (ontable y) (clear y) (handempty)
   added: (holding y)
   goals met: 2 of 4
6. (stack y m)
   deleted: (holding y) (clear m)
   added: (on y m) (clear y) (handempty)
   goals met: 3 of 4
7. (unstack r g)
   deleted: (on r g) (clear r) (handempty)
   added: (holding r) (clear g)
   goals met: 2 of 4
8. (putdown r)
   deleted: (holding r)
   added: (ontable r) (clear r) (handempty)
   goals met: 2 of 4
9. (pick g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 2 of 4
10. (stack g b)
   deleted: (holding g) (clear b)
   added: (on g b) (clear g) (handempty)
   goals met: 3 of 4
11. (pick r)
   deleted: (ontable r) (clear r) (handempty)
   added: (holding r)
   goals met: 3 of 4
12. (stack r g)
   deleted: (holding r) (clear g)
   added: (on r g) (clear r) (handempty)
   goals met: 4 of 4
